code-review/NRB_3471_3546/База_Было/InformationRegisters/РыночныеЦеныЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РыночныеЦеныЦенныхБумаг</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НКДРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЦБ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационноАналитическиеСистемы</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникКотировок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиКотировок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМетода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий (до 200 символов)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникНКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационноАналитическиеСистемы</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МетодикаРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодикиРасчетаРыночныхЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/Календарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Календарь</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Мы работаем по графику ММВБ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеЦБРФ</Name>
					<Comment>Не рабочий день по обычному производственному календарю РФ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/НоминалЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НоминалЦБ</Name>
			<Comment>Номинал ЦБ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма номинала</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>20</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Comment>ЦБ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЦБ</Name>
			<Comment>Типы ценных бумаг</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
					<Comment>Акция</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигация</Name>
					<Comment>Облигация</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вексель</Name>
					<Comment>Вексель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АДР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГДР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пай</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Золото</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарнаяРасписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиринговыйСертификатУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Варрант</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/СостоянияРасчетаРыночныхЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияРасчетаРыночныхЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачалоРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеДанных</Name>
					<Comment>Ожидание ответа на запрос котировок из BQ (и возможно также из Diasoft, в зависимости от методики расчета)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДанныеПолучены</Name>
					<Comment>Получены котировки из BQ (и возможно также из Diasoft, в зависимости от методики расчета)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетЗавершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаРасчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/РасчетРыночныхЦенДля0409404/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура - Производит расчет рыночных цен, возвращая таблицу результата расчета
// Этот код перенесен из модуля менеджера регистра сведений РыночныеЦеныЦенныхБумаг в отдельный модуль
// в связи с тем, что появился еще один расчет рыночных цен по другой методике, чтобы не возникало путаницы
//
// Параметры:
//  ВходящиеПараметры		 - Структура - Входящие параметры
//  ----.*МетодикаРасчета						 - ПеречислениеСсылка.МетодикиРасчетаРыночныхЦен
//  ----.*НачалоПериода							 - Дата	 - Начало периода расчета
//  ---- *ОкончаниеПериода						 - Дата	 - Окончание периода расчета
//  ---- *ПоОстаткам							 - Булево	 - Фильтр: Только по ценным бугам на остатке
//  ---- *ISINs									 - Строка	 - Фильтр: Только по ценным бумагам с указанными ISIN
//  ---- *ЗапросЦеныПоследнейСделкиПоISIN		- Булево	 - Принудительно полученить цену последней цены сделки
//  ---- *БезЗапросаЦеныПоследнейСделки			- Булево	 - Не запрашивать (в BQ) цену последней цены сделки
//  Отказ					 - Булево	 - Признак отказа
//  ТекстОтказа				 - Строка	 - Описание ошибки
//  ОтправлятьУведомление	 - Булево	 - Признак отправки результатов расчета на почту
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица результата
//
Функция РассчитатьРыночныеЦены(ВходящиеПараметры, Отказ, ТекстОтказа, ОтправлятьУведомление = Ложь) Экспорт
	ВремяНачалаФормирования = ОценкаПроизводительности.НачатьЗамерВремени();
	
	НачалоПериода = ВходящиеПараметры.НачалоПериода;
	ОкончаниеПериода = ВходящиеПараметры.ОкончаниеПериода;
	
	ПоОстаткам						 = ВходящиеПараметры.ПоОстаткам;
	ISINs							 = ВходящиеПараметры.ISINs;
	
	СквозныеПараметры = Новый Структура;
	СквозныеПараметры.Вставить("РабочихДнейДляВыборкиКотировок", 30);
	СквозныеПараметры.Вставить("ДнейДляВыборкиКотировокBQ", 365);
	СквозныеПараметры.Вставить("ПоОстаткам", ПоОстаткам);
	СквозныеПараметры.Вставить("ISINs", ISINs);
	СквозныеПараметры.Вставить("ЗапросЦеныПоследнейСделкиПоISIN", ВходящиеПараметры.ЗапросЦеныПоследнейСделкиПоISIN);
	СквозныеПараметры.Вставить("БезЗапросаЦеныПоследнейСделки", ВходящиеПараметры.БезЗапросаЦеныПоследнейСделки);
	Регламент = ПоОстаткам И Не ЗначениеЗаполнено(ISINs);
	СквозныеПараметры.Вставить("Регламент", Регламент);
	СквозныеПараметры.Вставить("МетодикаРасчета", ВходящиеПараметры.МетодикаРасчета);
	ПараметрыМетода = "ПоОстаткам=" + ПоОстаткам + ";" + "ISINs=" + ISINs;
	СквозныеПараметры.Вставить("ПараметрыМетода", ПараметрыМетода);
	
	РезультатыРасчета = РасчетРыночныхЦенОбщее.НовыеРезультатыРасчета();
	
	ТолькоРабочиеДни	 = Истина;
	ТаблицаПериодов		 = MarketData.ДопустимыйИнтервал(НачалоПериода, ОкончаниеПериода, ТолькоРабочиеДни);
	КоличествоДней		 = ТаблицаПериодов.Количество();
	ОтказЛокально		 = Ложь;
	ТекстОтказаЛокально	 = "";
	Для Каждого ТекСтрокаПериода Из ТаблицаПериодов Цикл
		ДатаРасчета = НачалоДня(ТекСтрокаПериода.РезультирующаяДата);
		СквозныеПараметры.Вставить("ДатаРасчета", ДатаРасчета);
		
		РассчитатьРыночныеЦеныНаДату(СквозныеПараметры, ОтказЛокально, ТекстОтказаЛокально, РезультатыРасчета);
		
		ТекстОтказа = ТекстОтказа + ?(ЗначениеЗаполнено(ТекстОтказа), Символы.ПС, "") + ТекстОтказаЛокально;
		ТекстОтказаЛокально = "";
		Отказ = Отказ Или ОтказЛокально; // BSLLS:UsingCancelParameter-off
		ОтказЛокально = Ложь;
	КонецЦикла;
	
	Если ОтправлятьУведомление Тогда
		ОкончательныйРасчет = РасчетРыночныхЦенОбщее.ЕстьОкончательныйРасчет(РезультатыРасчета);
		Если ОкончательныйРасчет Тогда
			ПериодСтрокой = ПредставлениеПериода(НачалоПериода, ОкончаниеПериода, "L=ru_RU");
			ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОРасчетеРыночныхЦенЦенныхБумаг;
			РасчетРыночныхЦенОбщее.ОтправитьУведомлениеОРасчетеРыночныхЦен(ВнешнийИсточник, ПериодСтрокой, 
				ВходящиеПараметры.МетодикаРасчета, РезультатыРасчета);
		КонецЕсли;
	КонецЕсли;
	
	ВесЗамера = 0;
	Для Каждого ПериодРасчета Из РезультатыРасчета Цикл
		ВесЗамера = ВесЗамера + ПериодРасчета.Количество;
	КонецЦикла;
	ОценкаПроизводительности.ЗакончитьЗамерВремени("РасчетРыночныхЦен_0409404", ВремяНачалаФормирования, ВесЗамера, КоличествоДней);
	
	Возврат РезультатыРасчета;
	
КонецФункции

// Процедура рассчитывает рыночные цены за нерабочие дени в периоде (предполагается что за рабочие дни рыночные
// цены уже расчитаны к этому моменту).
// Параметры:
//  ПараметрыРасчета	 - Структура - включающая, как минимум, следующие элементы:
//  ---- *НачалоПериода		 - Дата	 - Начало периода расчета
//  ---- *ОкончаниеПериода	 - Дата	 - Окончание периода расчета
//  ---- *ПоОстаткам		 - Булево	 - Фильтр: Только по ценным бугам на остатке
//  ---- *ISINs				 - Строка	 - Фильтр: Только по ценным бумагам с указанными ISIN
//  РезультатыРасчета	 - ТаблицаЗначений - включающая как минимум колонки ВидРасчета,
//  										ДатаРасчета, Комментарий, Отказ, ТекстОтказа.
//  Отказ				 - Булево	 - Признак отказа
//  ТекстОтказа			 - Строка	 - Описание ошибки
Процедура РассчитатьРыночныеЦеныЗаНерабочиеДниПериода(ПараметрыРасчета, РезультатыРасчета, Отказ, ТекстОтказа) Экспорт
	Период = ПараметрыРасчета.НачалоПериода;
	Пока Период <= ПараметрыРасчета.ОкончаниеПериода Цикл
		Если Не ОбщегоНазначения.РабочийДень(Период) Тогда
			ОтказЛокально			 = Ложь;
			ТекстОтказаЛокально		 = "";
			ПоОстаткам = ПараметрыРасчета.ПоОстаткам;
			ISINs = ПараметрыРасчета.ISINs;
			РассчитатьРыночныеЦеныЗаНерабочийДень(Период, ПоОстаткам, ISINs, ОтказЛокально, ТекстОтказаЛокально);
			Если ОтказЛокально Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибки при расчете за нерабочий день: " + ТекстОтказаЛокально);
				Отказ = Отказ Или ОтказЛокально;
				ТекстОтказа = ТекстОтказа + ?(ЗначениеЗаполнено(ТекстОтказа), Символы.ПС, "") + ТекстОтказаЛокально;
			КонецЕсли;
			НоваяСтрокаТЗ = РезультатыРасчета.Добавить();
			НоваяСтрокаТЗ.ВидРасчета = "Расчет за нерабочий день";
			НоваяСтрокаТЗ.ДатаРасчета = Формат(Период, "ДФ=""дд.ММ.гггг""");
			НоваяСтрокаТЗ.Комментарий = "ПоОстаткам=" + Строка(ПоОстаткам) + ";ISINs=" + ISINs;
			НоваяСтрокаТЗ.Отказ = ОтказЛокально;
			НоваяСтрокаТЗ.ТекстОтказа = ТекстОтказаЛокально;
		КонецЕсли;
		Период = КонецДня(Период) + 1;
	КонецЦикла;
КонецПроцедуры

// Процедура рассчитывает рыночные цены за нерабочий день
//
// Параметры:
//  ДатаРасчета	- Дата		- Дата для расчета (выходной день)
//  ПоОстаткам	- Булево	- Фильтр: Только по ценным бугам на остатке
//  ISINs		- Строка	- Фильтр: Только по ценным бумагам с указанными ISIN
//  Отказ		- Булево	- Признак отказа
//  ТекстОтказа	- Строка	- Описание ошибки
//
Процедура РассчитатьРыночныеЦеныЗаНерабочийДень(ДатаРасчета, ПоОстаткам, ISINs, Отказ, ТекстОтказа) Экспорт
	
	Запрос = Новый Запрос;
	
	Если Не ПоОстаткам Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(РыночныеЦеныЦенныхБумаг.Период) КАК Период,
		|	РыночныеЦеныЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ ПоследниеРабочиеДниИзРегистраРыночныхЦен
		|ИЗ
		|	РегистрСведений.РыночныеЦеныЦенныхБумаг КАК РыночныеЦеныЦенныхБумаг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Календарь КАК Календарь
		|		ПО (РыночныеЦеныЦенныхБумаг.Период = Календарь.Период)
		|			И РыночныеЦеныЦенныхБумаг.Период < &ДатаРасчета
		|			И РыночныеЦеныЦенныхБумаг.МетодикаРасчета = ЗНАЧЕНИЕ(Перечисление.МетодикиРасчетаРыночныхЦен.Для0409404)
		|			И (НЕ Календарь.Значение)
		|
		|СГРУППИРОВАТЬ ПО
		|	РыночныеЦеныЦенныхБумаг.ЦеннаяБумага
		|;
		|
		|";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиЦБОстатки.ЦБ КАК ЦБ
		|ПОМЕСТИТЬ ЦенныеБумаги
		|ИЗ
		|	РегистрНакопления.ОстаткиЦБ.Остатки(
		|			&ПериодОстатков,
		|			ЦБ.ISIN В (&МассивISIN)
		|			И ВЫБОР
		|				КОГДА ЦБ.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.ДепозитарнаяРасписка)
		|					ТОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ЦБ.БазовыйАктив КАК Справочник.ЦенныеБумаги).Эмитент.ЮридическиеФизическиеЛица.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.РОССИЯ))
		|				ИНАЧЕ НЕ ЕСТЬNULL(ЦБ.Эмитент.ЮридическиеФизическиеЛица.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.РОССИЯ))
		|			КОНЕЦ) КАК ОстаткиЦБОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиЦБОстатки.ЦБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(РыночныеЦеныЦенныхБумаг.Период) КАК Период,
		|	РыночныеЦеныЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ ПоследниеРабочиеДниИзРегистраРыночныхЦен
		|ИЗ
		|	ЦенныеБумаги КАК ЦенныеБумаги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РыночныеЦеныЦенныхБумаг КАК РыночныеЦеныЦенныхБумаг
		|		ПО ЦенныеБумаги.ЦБ = РыночныеЦеныЦенныхБумаг.ЦеннаяБумага
		|			И (РыночныеЦеныЦенныхБумаг.Период < &ДатаРасчета) 
		|			И РыночныеЦеныЦенныхБумаг.МетодикаРасчета = ЗНАЧЕНИЕ(Перечисление.МетодикиРасчетаРыночныхЦен.Для0409404)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Календарь КАК Календарь
		|		ПО (РыночныеЦеныЦенныхБумаг.Период = Календарь.Период)
		|			И (НЕ Календарь.Значение)
		|
		|СГРУППИРОВАТЬ ПО
		|	РыночныеЦеныЦенныхБумаг.ЦеннаяБумага
		|;
		|
		|";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст
		+ "////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	ВЫБОР
		|		КОГДА КурсыВалютСрезПоследних.Кратность = 0
		|			ТОГДА 1
		|		ИНАЧЕ КурсыВалютСрезПоследних.Кратность
		|	КОНЕЦ КАК Кратность
		|ПОМЕСТИТЬ РегистрСведенийКурсыВалют
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаРасчета, ИСТИНА) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ДатаРасчета КАК Период,
		|	РыночныеЦеныЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЗНАЧЕНИЕ(Перечисление.МетодикиРасчетаРыночныхЦен.Для0409404) КАК МетодикаРасчета,
		|	РыночныеЦеныЦенныхБумаг.Цена КАК Цена,
		|	РыночныеЦеныЦенныхБумаг.Валюта КАК Валюта,
		|	РыночныеЦеныЦенныхБумаг.ЦенаРуб КАК ЦенаРуб,
		|	РыночныеЦеныЦенныхБумаг.НКДРуб КАК НКДРуб,
		|	РыночныеЦеныЦенныхБумаг.ЦенаЦБ КАК ЦенаЦБ,
		|	РыночныеЦеныЦенныхБумаг.НКД КАК НКД,
		|	РыночныеЦеныЦенныхБумаг.ВалютаЦБ КАК ВалютаЦБ,
		|	ЕСТЬNULL(КурсыВалют.Курс, 0) КАК КурсыВалютКурс,
		|	ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК КурсыВалютКратность,
		|	ЕСТЬNULL(КурсыВалютЦБ.Курс, 0) КАК КурсыВалютЦБКурс,
		|	ЕСТЬNULL(КурсыВалютЦБ.Кратность, 1) КАК КурсыВалютЦБКратность,
		|	РыночныеЦеныЦенныхБумаг.Биржа КАК Биржа,
		|	РыночныеЦеныЦенныхБумаг.ИсточникКотировок КАК ИсточникКотировок,
		|	РыночныеЦеныЦенныхБумаг.Уровень КАК Уровень,
		|	РыночныеЦеныЦенныхБумаг.КодМетода КАК КодМетода,
		|	РыночныеЦеныЦенныхБумаг.Комментарий КАК Комментарий,
		|	РыночныеЦеныЦенныхБумаг.ИсточникНКД КАК ИсточникНКД
		|ИЗ
		|	ПоследниеРабочиеДниИзРегистраРыночныхЦен КАК ПоследниеРабочиеДниИзРегистраРыночныхЦен
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РыночныеЦеныЦенныхБумаг КАК РыночныеЦеныЦенныхБумаг
		|		ПО ПоследниеРабочиеДниИзРегистраРыночныхЦен.ЦеннаяБумага = РыночныеЦеныЦенныхБумаг.ЦеннаяБумага
		|			И ПоследниеРабочиеДниИзРегистраРыночныхЦен.Период = РыночныеЦеныЦенныхБумаг.Период
		|			И РыночныеЦеныЦенныхБумаг.МетодикаРасчета = ЗНАЧЕНИЕ(Перечисление.МетодикиРасчетаРыночныхЦен.Для0409404)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийКурсыВалют КАК КурсыВалют
		|		ПО (РыночныеЦеныЦенныхБумаг.Валюта = КурсыВалют.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийКурсыВалют КАК КурсыВалютЦБ
		|		ПО (РыночныеЦеныЦенныхБумаг.ВалютаЦБ = КурсыВалютЦБ.Валюта)";
	Запрос.УстановитьПараметр("ВалютаРубль", Справочники.Валюты.Рубль());
	Запрос.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
	Если ЗначениеЗаполнено(ISINs) Тогда
		МассивISIN = СтрРазделить(ISINs, ",", Ложь);
		Запрос.УстановитьПараметр("МассивISIN", МассивISIN);
		Регламент = Ложь;
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЦБ.ISIN В (&МассивISIN)", "1 = 1");
		Регламент = Истина;
	КонецЕсли;
	Если ПоОстаткам Тогда
		ПериодОстатков = КонецДня(ДатаРасчета) + 1;
		Запрос.УстановитьПараметр("ПериодОстатков", ПериодОстатков);
	КонецЕсли;
	РасчетРыночныхЦенЦенныхБумаг = Запрос.Выполнить().Выгрузить();
	ПересчитатьЦеныЦБПоКурсуВНерабочийДень(РасчетРыночныхЦенЦенныхБумаг);
	
	МетодикаРасчета = Перечисления.МетодикиРасчетаРыночныхЦен.Для0409404;
	СквозныеПараметры = Новый Структура("ДатаРасчета, Регламент, МетодикаРасчета", ДатаРасчета, Регламент, МетодикаРасчета);
	РасчетРыночныхЦенОбщее.ЗаписатьРыночныеЦены(СквозныеПараметры, РасчетРыночныхЦенЦенныхБумаг);
	
КонецПроцедуры

// Процедура - Заполнить таблицу рыночных цен для регуляторного отчета 0409404
//
// Параметры:
//  ОтчетныйПериод	 - Дата			 - Период рыночных цен
//  ИспользуемыеЦБ	 - ТаблицаЗначений	 - таблица с колонкой ЦеннаяБумага (содержит ссылки на ценные бумаги)
//  РыночныеЦеныЦБ	 - ТаблицаЗначений	 - таблица, формат см. РегуляторнаяОтчетность_Форма_0409404_3_0_6406, Функция РыночныеЦеныЦБ
//  СрезНаДату		 - Булево			 - Использовать ли срез последних (при определении рыночной цены на указанный отчетный приод)
//
Процедура ЗаполнитьТаблицуДляОтчета0409404(ОтчетныйПериод, ИспользуемыеЦБ, РыночныеЦеныЦБ, СрезНаДату) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	// BSLLS:QueryParseError-off
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА КурсыВалютСрезПоследних.Кратность = 0
	|			ТОГДА КурсыВалютСрезПоследних.Курс
	|		ИНАЧЕ КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
	|	КОНЕЦ КАК Курс
	|ПОМЕСТИТЬ РегистрСведенийКурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, ИСТИНА) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РыночныеЦеныЦенныхБумагСрезПоследних.ЦеннаяБумага КАК ЦБ,
	|	РыночныеЦеныЦенныхБумагСрезПоследних.ЦеннаяБумага.НомерРегистрации КАК RegNum,
	|	РыночныеЦеныЦенныхБумагСрезПоследних.ЦеннаяБумага.ISIN КАК ISIN,
	|	РыночныеЦеныЦенныхБумагСрезПоследних.Цена - ВЫБОР
	|		КОГДА РыночныеЦеныЦенныхБумагСрезПоследних.Уровень = 3
	|			ТОГДА 0
	|		ИНАЧЕ РыночныеЦеныЦенныхБумагСрезПоследних.НКД
	|	КОНЕЦ КАК Rate,
	|	(РыночныеЦеныЦенныхБумагСрезПоследних.Цена - ВЫБОР
	|		КОГДА РыночныеЦеныЦенныхБумагСрезПоследних.Уровень = 3
	|			ТОГДА 0
	|		ИНАЧЕ РыночныеЦеныЦенныхБумагСрезПоследних.НКД
	|	КОНЕЦ) * ЕСТЬNULL(КурсВалюты.Курс, 0) / ЕСТЬNULL(КурсВалютыНоминала.Курс, 1) КАК RateNominal,
	|	РыночныеЦеныЦенныхБумагСрезПоследних.Цена КАК RateWithAccru,
	|	РыночныеЦеныЦенныхБумагСрезПоследних.Цена * ЕСТЬNULL(КурсВалюты.Курс, 0) / ЕСТЬNULL(КурсВалютыНоминала.Курс, 1) КАК RateNominalWithAccru,
	|	ВЫБОР
	|		КОГДА РыночныеЦеныЦенныхБумагСрезПоследних.ЦеннаяБумага.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.ДепозитарнаяРасписка)
	|				И НЕ РыночныеЦеныЦенныхБумагСрезПоследних.ЦеннаяБумага.БазовыйАктив В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка))
	|			ТОГДА РыночныеЦеныЦенныхБумагСрезПоследних.ЦеннаяБумага.БазовыйАктив.ВалютаНоминала.Код
	|		ИНАЧЕ РыночныеЦеныЦенныхБумагСрезПоследних.ЦеннаяБумага.ВалютаНоминала.Код
	|	КОНЕЦ КАК NominalCurrency,
	|	ВЫРАЗИТЬ(СТРОКА(РыночныеЦеныЦенныхБумагСрезПоследних.Уровень) КАК СТРОКА(1)) КАК Level,
	|	РыночныеЦеныЦенныхБумагСрезПоследних.КодМетода КАК Metod
	|ИЗ
	|	РегистрСведений.РыночныеЦеныЦенныхБумаг.СрезПоследних(
	|			&Период,
	|			ВЫБОР
	|					КОГДА &СрезНаДату
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Период = &Период
	|				КОНЕЦ
	|				И МетодикаРасчета = ЗНАЧЕНИЕ(Перечисление.МетодикиРасчетаРыночныхЦен.Для0409404)
	|				И ЦеннаяБумага.Ссылка В (&ЦенныеБумаги)
	|				И НЕ ЦеннаяБумага.ПометкаУдаления) КАК РыночныеЦеныЦенныхБумагСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийКурсыВалют КАК КурсВалютыНоминала
	|		ПО (ВЫБОР
	|				КОГДА РыночныеЦеныЦенныхБумагСрезПоследних.ЦеннаяБумага.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.ДепозитарнаяРасписка)
	|						И НЕ РыночныеЦеныЦенныхБумагСрезПоследних.ЦеннаяБумага.БазовыйАктив В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка))
	|					ТОГДА РыночныеЦеныЦенныхБумагСрезПоследних.ЦеннаяБумага.БазовыйАктив.ВалютаНоминала
	|				ИНАЧЕ РыночныеЦеныЦенныхБумагСрезПоследних.ЦеннаяБумага.ВалютаНоминала
	|			КОНЕЦ = КурсВалютыНоминала.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийКурсыВалют КАК КурсВалюты
	|		ПО РыночныеЦеныЦенныхБумагСрезПоследних.Валюта = КурсВалюты.Валюта";
	// BSLLS:QueryParseError-on
	Запрос.УстановитьПараметр("СрезНаДату", СрезНаДату);
	Запрос.УстановитьПараметр("Период", НачалоДня(ОтчетныйПериод));
	Запрос.УстановитьПараметр("ЦенныеБумаги", ОбщегоНазначения.ВыгрузитьКолонку(ИспользуемыеЦБ, "ЦеннаяБумага", Истина, Истина));
	
	РыночныеЦеныЦБ = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Процедура - Рассчитать рыночные цены на дату
//
// Параметры:
//  СквозныеПараметры	 - Структура	 - Произвольные входные параметры
//  Отказ				 - Булево		 - Признак отказа
//  ТекстОтказа			 - Строка		 - Описание ошибки
//  РезультатыРасчета	 - ТаблицаЗначений	 - см. Функция НовыеРезультатыРасчета
//
Процедура РассчитатьРыночныеЦеныНаДату(СквозныеПараметры, Отказ, ТекстОтказа, РезультатыРасчета)
	
	НовыйРезультатРасчета = РезультатыРасчета.Добавить();
	НовыйРезультатРасчета.ДатаРасчета = Формат(СквозныеПараметры.ДатаРасчета, "ДЛФ=D");
	НовыйРезультатРасчета.Комментарий = СквозныеПараметры.ПараметрыМетода;
	
	СостояниеРасчета = РегистрыСведений.СостоянияРасчетаРыночныхЦенЦенныхБумаг.ПолучитьСостояние(СквозныеПараметры);
	СквозныеПараметры.Вставить("ИдентификаторЗапросаBQ", СостояниеРасчета.ИдентификаторЗапросаBQ);
	СквозныеПараметры.Вставить("ИдентификаторЗапросаDiasoft", СостояниеРасчета.ИдентификаторЗапросаDiasoft);
	СквозныеПараметры.Вставить("ПолученОтветBQ", СостояниеРасчета.ПолученОтветBQ);
	СквозныеПараметры.Вставить("ПолученОтветDiasoft", СостояниеРасчета.ПолученОтветDiasoft);
		
	НачатьТранзакцию();
	Попытка
		НовыйРезультатРасчета.СостояниеБыло = СостояниеРасчета.Состояние;
		
		ПервичныйРасчет =
			СостояниеРасчета.Состояние = Перечисления.СостоянияРасчетаРыночныхЦен.ПустаяСсылка()
			Или СостояниеРасчета.Состояние = Перечисления.СостоянияРасчетаРыночныхЦен.ОшибкаРасчета
			Или СостояниеРасчета.Состояние = Перечисления.СостоянияРасчетаРыночныхЦен.РасчетЗавершен;
		СквозныеПараметры.Вставить("ПервичныйРасчет", ПервичныйРасчет);
		ОкончательныйРасчет = СостояниеРасчета.Состояние = Перечисления.СостоянияРасчетаРыночныхЦен.ДанныеПолучены;
		СквозныеПараметры.Вставить("ОкончательныйРасчет", ОкончательныйРасчет);
		
		Если ПервичныйРасчет Тогда
			СквозныеПараметры.ИдентификаторЗапросаBQ = "";
		Иначе
			СквозныеПараметры.ИдентификаторЗапросаBQ = СостояниеРасчета.ИдентификаторЗапросаBQ;
		КонецЕсли;
		СквозныеПараметры.ИдентификаторЗапросаDiasoft = "";	// При использовании методики 0409404 запрос к Diasoft не требуется.
		
		Если СквозныеПараметры.ПервичныйРасчет Или СквозныеПараметры.ОкончательныйРасчет Тогда
			
			РасчетРыночныхЦенОбщее.ПроверитьНаличиеКотировокНРДиCBonds(СквозныеПараметры);
			
			СостояниеСтало = Перечисления.СостоянияРасчетаРыночныхЦен.НачалоРасчета;
			РегистрыСведений.СостоянияРасчетаРыночныхЦенЦенныхБумаг.УстановитьСостояние(СквозныеПараметры,
				СостояниеСтало, "");
			
			РассчитатьИЗаписатьРыночныеЦены(СквозныеПараметры, Отказ, ТекстОтказа, НовыйРезультатРасчета, СостояниеСтало);
			
			Если Не Отказ Тогда
				РегистрыСведений.СостоянияРасчетаРыночныхЦенЦенныхБумаг.УстановитьСостояние(СквозныеПараметры,
					СостояниеСтало, НовыйРезультатРасчета.Комментарий);
				НовыйРезультатРасчета.СостояниеСтало = СостояниеСтало;
			Иначе
				НовыйРезультатРасчета.Комментарий = ТекстОтказа;
			КонецЕсли;
		КонецЕсли;
		
		РасчетРыночныхЦенОбщее.СформироватьВидРасчетаСтрокой(СквозныеПараметры, НовыйРезультатРасчета);
		
		Если Отказ Тогда
			ВызватьИсключение ТекстОтказа;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		НовыйРезультатРасчета.ТекстОтказа = ТекстОшибки;
		Отказ = Истина;
		ТекстОтказа = ТекстОшибки + Символы.ПС + ТекстОтказа;
		
		РасчетРыночныхЦенОбщее.СформироватьВидРасчетаСтрокой(СквозныеПараметры, НовыйРезультатРасчета);
		СостояниеСтало = Перечисления.СостоянияРасчетаРыночныхЦен.ОшибкаРасчета;
		РегистрыСведений.СостоянияРасчетаРыночныхЦенЦенныхБумаг.УстановитьСостояние(СквозныеПараметры, СостояниеСтало, ТекстОшибки);
		НовыйРезультатРасчета.СостояниеСтало = СостояниеСтало;
		
	КонецПопытки;
	НовыйРезультатРасчета.Отказ = Отказ;
	
КонецПроцедуры

Процедура РассчитатьИЗаписатьРыночныеЦены(СквозныеПараметры, Отказ, ТекстОтказа, НовыйРезультатРасчета, СостояниеСтало)
	
	РезультатыПакета = ПакетныйЗапросРасчетаРыночныхЦенЦенныхБумаг(СквозныеПараметры);
	ИндексПоследнегоЗапроса = РезультатыПакета.Количество() - 1;
	ИндексВторогоЗапросаСКонца = ИндексПоследнегоЗапроса - 1;
	РезультатыЗапросаРыночныеЦены = РезультатыПакета[ИндексВторогоЗапросаСКонца];
	РезультатыЗапросаЦенныеБумаги = РезультатыПакета[ИндексПоследнегоЗапроса];
	РасчетРыночныхЦенЦенныхБумаг = РезультатыЗапросаРыночныеЦены.Выгрузить();
	// Из-за проблем с округлениями и разрядностью в SQL ЦенуЦБ (в валюте ЦБ) рассчитываем при обработке результатов запроса
	// а не в нем самом
	РасчетРыночныхЦенОбщее.РассчитатьЦеныВВалютеЦБ(РасчетРыночныхЦенЦенныхБумаг);
	
	СостояниеСтало = Перечисления.СостоянияРасчетаРыночныхЦен.РасчетЗавершен;
	Если СквозныеПараметры.ПервичныйРасчет Тогда
		ЦенныеБумагиКЗапросу = РезультатыЗапросаЦенныеБумаги.Выгрузить();
		НеобходимоЗапроситьBQ = ЗначениеЗаполнено(ЦенныеБумагиКЗапросу)
			И Не СквозныеПараметры.БезЗапросаЦеныПоследнейСделки
			И Не ТестированиеVanessa.ЭтоТест();
		
		Если НеобходимоЗапроситьBQ Тогда
			ISINs = ОбщегоНазначения.ВыгрузитьКолонку(ЦенныеБумагиКЗапросу, "ISIN", Истина, Истина);
			НовыйРезультатРасчета.Количество = ЦенныеБумагиКЗапросу.Количество();
			НовыйРезультатРасчета.Комментарий = СтрСоединить(ISINs, ", ");
			Попытка
				СквозныеПараметры.ИдентификаторЗапросаBQ = ПолучениеЦеныПоследнейСделки.ЗапросBQ(СквозныеПараметры, ЦенныеБумагиКЗапросу);
				СостояниеСтало = Перечисления.СостоянияРасчетаРыночныхЦен.ПолучениеДанных;
			Исключение
				СостояниеСтало =  Перечисления.СостоянияРасчетаРыночныхЦен.ОшибкаРасчета;
				Отказ = Истина;
				ТекстОтказа = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
		Иначе
			СквозныеПараметры.ПервичныйРасчет = Ложь;
			СквозныеПараметры.ОкончательныйРасчет = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РасчетРыночныхЦенЦенныхБумаг) Тогда
		Если СостояниеСтало = Перечисления.СостоянияРасчетаРыночныхЦен.РасчетЗавершен Тогда
			ISINs = ОбщегоНазначения.ВыгрузитьКолонку(РасчетРыночныхЦенЦенныхБумаг, "ISIN", Истина, Истина);
			НовыйРезультатРасчета.Количество = РасчетРыночныхЦенЦенныхБумаг.Количество();
			НовыйРезультатРасчета.Комментарий = СтрСоединить(ISINs, ", ");
		КонецЕсли;
		РасчетРыночныхЦенОбщее.ЗаписатьРыночныеЦены(СквозныеПараметры, РасчетРыночныхЦенЦенныхБумаг);
	Иначе
		НовыйРезультатРасчета.Комментарий = "Нет данных для расчета";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьЦеныЦБПоКурсуВНерабочийДень(РасчетРыночныхЦенЦенныхБумаг)
	ВалютаРубль = Справочники.Валюты.Рубль();
	
	Для Каждого Данные Из РасчетРыночныхЦенЦенныхБумаг Цикл
		ВалютаЦБ = Данные.ВалютаЦБ;
		Валюта = Данные.Валюта;
		Если Валюта = ВалютаРубль И ВалютаЦБ = ВалютаРубль Тогда
			Продолжить;
		КонецЕсли;
		
		Цена = Данные.Цена;
		ЦенаЦБ = Данные.Цена;
		НКД = Данные.НКД;
		ВалютаКурс = Данные.КурсыВалютКурс;
		ВалютаЦБКурс = Данные.КурсыВалютЦБКурс;
		ВалютаКратность = ?(Данные.КурсыВалютКратность = 0, 1, Данные.КурсыВалютКратность);
		ВалютаЦБКратность = ?(Данные.КурсыВалютЦБКратность = 0, 1, Данные.КурсыВалютЦБКратность);
		
		Если ВалютаЦБ <> ВалютаРубль Тогда
			Данные.НКДРуб = РасчетРыночныхЦенОбщее.ИзВалютыВВалюту6Знаков(НКД, ВалютаЦБ, ВалютаРубль, ВалютаЦБКурс, 1, ВалютаКратность, 1);
		КонецЕсли;
		
		Если Валюта <> ВалютаРубль Тогда
			Данные.ЦенаРуб = РасчетРыночныхЦенОбщее.ИзВалютыВВалюту6Знаков(Цена, Валюта, ВалютаРубль, ВалютаКурс, 1, ВалютаКратность, 1);
		КонецЕсли;
		
		Если Валюта <> ВалютаЦБ Тогда
			Если ВалютаЦБ = ВалютаРубль Тогда
				Данные.ЦенаЦБ = РасчетРыночныхЦенОбщее.ИзВалютыВВалюту6Знаков(ЦенаЦБ, Валюта, ВалютаРубль, ВалютаКурс, 1, ВалютаКратность, 1);
			ИначеЕсли Валюта = ВалютаРубль Тогда
				Данные.ЦенаЦБ = РасчетРыночныхЦенОбщее.ИзВалютыВВалюту6Знаков(Цена, ВалютаРубль, ВалютаЦБ, 1, ВалютаЦБКурс, 1, ВалютаЦБКратность);
			Иначе
				Данные.ЦенаЦБ = РасчетРыночныхЦенОбщее.ИзВалютыВВалюту6Знаков(Цена, Валюта, ВалютаЦБ, ВалютаКурс, ВалютаЦБКурс,
																		ВалютаКратность, ВалютаЦБКратность);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Функция выполняет пакетный запрос для получения данных, необходимых для расчета рыночных цен ЦБ
// и возвращает его результаты.
// Параметры:
//  СквозныеПараметры		 - Структура - Входящие параметры, включая:
//  ----.*ДатаРасчета					 - Дата
//  ---- *ДнейДляВыборкиКотировокBQ		 - Число
//  ---- *РабочихДнейДляВыборкиКотировок - Число
//  ---- *ПоОстаткам					 - Булево	 - Фильтр: Только по ценным бугам на остатке
//  ---- *ISINs							 - Строка	 - Фильтр: Только по ценным бумагам с указанными ISIN
//  ---- *ЗапросЦеныПоследнейСделкиПоISIN - Булево
// Возвращаемое значение:
//   - Массив - Массив результатов выполнения запросов
//
// BSLLS:MethodSize-off
Функция ПакетныйЗапросРасчетаРыночныхЦенЦенныхБумаг(СквозныеПараметры)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МетодикаРасчета", СквозныеПараметры.МетодикаРасчета);
	ПериодОстатков = КонецДня(СквозныеПараметры.ДатаРасчета) + 1;
	Запрос.УстановитьПараметр("Период", ПериодОстатков);
	НачалоПериодаКотировокBQ = ПериодОстатков - ОбщегоНазначенияПовтИсп.СекундВСутках(СквозныеПараметры.ДнейДляВыборкиКотировокBQ);
	Запрос.УстановитьПараметр("НачалоПериодаКотировокBQ", НачалоДня(НачалоПериодаКотировокBQ));
	НачалоПериодаКотировок = ОбщегоНазначения.ДобавитьРабочийДень(ПериодОстатков, 0 - СквозныеПараметры.РабочихДнейДляВыборкиКотировок);
	Если НачалоПериодаКотировок = ПериодОстатков Тогда // Не заполнен календарь рабочих дней
		НачалоПериодаКотировок = ПериодОстатков - ОбщегоНазначенияПовтИсп.СекундВСутках(СквозныеПараметры.РабочихДнейДляВыборкиКотировок);
	КонецЕсли;
	Запрос.УстановитьПараметр("НачалоПериодаКотировок", НачалоДня(НачалоПериодаКотировок));
	КонецПериодаКотировок = СквозныеПараметры.ДатаРасчета;
	Запрос.УстановитьПараметр("КонецПериодаКотировок", КонецДня(КонецПериодаКотировок));
	Запрос.УстановитьПараметр("ДатаТ", НачалоДня(КонецПериодаКотировок));
	
	Запрос.УстановитьПараметр("ПоОстаткам", СквозныеПараметры.ПоОстаткам);
	Если ЗначениеЗаполнено(СквозныеПараметры.ISINs) Тогда
		Запрос.УстановитьПараметр("ПоВсемISIN", Ложь);
		Запрос.УстановитьПараметр("ISIN", СтрРазделить(СквозныеПараметры.ISINs, ",", Ложь));
	Иначе
		Запрос.УстановитьПараметр("ПоВсемISIN", Истина);
		Запрос.УстановитьПараметр("ISIN", "");
	КонецЕсли;
	Запрос.УстановитьПараметр("ВключаяБазовыеАктивыЦенныхБумаг", Ложь);
	Запрос.УстановитьПараметр("ЗапросЦеныПоследнейСделкиПоISIN", СквозныеПараметры.ЗапросЦеныПоследнейСделкиПоISIN);
	Запрос.УстановитьПараметр("ТипыДепозитарныхРасписок", Перечисления.ТипыЦБ.ВсеТипыДепозитарныхРасписок());
	
	// При добавлении в запрос временных таблиц - учесть, что результаты последних двух запросов пакета используются 
	// в процедуре РассчитатьИЗаписатьРыночныеЦены, они должны оставаться последними.
	// BSLLS:QueryParseError-off
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ РегистрСведенийКурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериодаКотировок, ) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБОстатки.ЦБ КАК ЦБ
	|ПОМЕСТИТЬ РегистрНакопленияОстаткиЦБОстатки
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&Период,
	|			ВЫБОР
	|					КОГДА &ПоВсемISIN
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЦБ.ISIN В (&ISIN)
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА ЦБ.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.ДепозитарнаяРасписка)
	|						ТОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ЦБ.БазовыйАктив КАК Справочник.ЦенныеБумаги).Эмитент.ЮридическиеФизическиеЛица.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.РОССИЯ))
	|					ИНАЧЕ НЕ ЕСТЬNULL(ЦБ.Эмитент.ЮридическиеФизическиеЛица.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.РОССИЯ))
	|				КОНЕЦ) КАК ОстаткиЦБОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиЦБОстатки.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка КАК Ссылка,
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ЦенныеБумаги.НомерРегистрации КАК НомерРегистрации,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.БазовыйАктив КАК Справочник.ЦенныеБумаги) КАК БазовыйАктив
	|ПОМЕСТИТЬ ПервичныйСписокЦенныхБумаг
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопленияОстаткиЦБОстатки КАК ОстаткиЦБОстатки
	|		ПО ЦенныеБумаги.Ссылка = ОстаткиЦБОстатки.ЦБ
	|ГДЕ
	|	НЕ ЦенныеБумаги.ПометкаУдаления
	|	И НЕ ЦенныеБумаги.ISIN = """"
	|	И ВЫБОР
	|			КОГДА &ПоОстаткам
	|				ТОГДА НЕ ОстаткиЦБОстатки.ЦБ ЕСТЬ NULL
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ПоВсемISIN
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЦенныеБумаги.ISIN В (&ISIN)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ЦенныеБумаги.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.ДепозитарнаяРасписка)
	|				ТОГДА НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ЦенныеБумаги.БазовыйАктив КАК Справочник.ЦенныеБумаги).Эмитент.ЮридическиеФизическиеЛица.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.РОССИЯ))
	|			ИНАЧЕ НЕ ЕСТЬNULL(ЦенныеБумаги.Эмитент.ЮридическиеФизическиеЛица.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.РОССИЯ))
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦенныеБумаги.Ссылка,
	|	ВЫРАЗИТЬ(ЦенныеБумаги.БазовыйАктив КАК Справочник.ЦенныеБумаги)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПервичныйСписокЦенныхБумаг.БазовыйАктив КАК БазовыйАктив
	|ПОМЕСТИТЬ БазовыеАктивы
	|ИЗ
	|	ПервичныйСписокЦенныхБумаг КАК ПервичныйСписокЦенныхБумаг
	|ГДЕ
	|	&ВключаяБазовыеАктивыЦенныхБумаг = ИСТИНА
	|	И НЕ ПервичныйСписокЦенныхБумаг.БазовыйАктив = ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПервичныйСписокЦенныхБумаг.Ссылка КАК Актив,
	|	ВЫБОР
	|		КОГДА ПервичныйСписокЦенныхБумаг.Ссылка.ТипЦБ В (&ТипыДепозитарныхРасписок)
	|				И НЕ ПервичныйСписокЦенныхБумаг.Ссылка.БазовыйАктив В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка))
	|			ТОГДА ПервичныйСписокЦенныхБумаг.Ссылка.БазовыйАктив.ВалютаНоминала
	|		ИНАЧЕ ПервичныйСписокЦенныхБумаг.Ссылка.ВалютаНоминала
	|	КОНЕЦ КАК ВалютаНоминала
	|ПОМЕСТИТЬ СписокЦенныхБумаг
	|ИЗ
	|	ПервичныйСписокЦенныхБумаг КАК ПервичныйСписокЦенныхБумаг
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	БазовыеАктивы.БазовыйАктив,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|ИЗ
	|	БазовыеАктивы КАК БазовыеАктивы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоручениеЦенныеБумагиСписываемые.ЦеннаяБумага КАК ЦеннаяБумага,
	|	МАКСИМУМ(Поручение.Дата) КАК ПоручениеДата
	|ПОМЕСТИТЬ ПогашенныеДолговыеБумаги
	|ИЗ
	|	Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦенныеБумагиСписываемые
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение КАК Поручение
	|		ПО ПоручениеЦенныеБумагиСписываемые.Ссылка = Поручение.Ссылка
	|ГДЕ
	|	ПоручениеЦенныеБумагиСписываемые.ЦеннаяБумага В
	|			(ВЫБРАТЬ
	|				СписокЦенныхБумаг.Актив КАК Актив
	|			ИЗ
	|				СписокЦенныхБумаг КАК СписокЦенныхБумаг)
	|	И Поручение.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ПогашениеЦБПолное)
	|	И ПоручениеЦенныеБумагиСписываемые.ЦеннаяБумага.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
	|	И ВЫБОР
	|			КОГДА ПоручениеЦенныеБумагиСписываемые.ЦеннаяБумага.ДатаПогашения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ПоручениеЦенныеБумагиСписываемые.ЦеннаяБумага.ДатаПогашения < &ДатаТ
	|		КОНЕЦ
	|	И Поручение.ДатаИсполненияПоручения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И Поручение.Дата < &ДатаТ
	|	И Поручение.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоручениеЦенныеБумагиСписываемые.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка КАК ЦеннаяБумагаВПериоде,
	|	МАКСИМУМ(НоминалЦБ.Период) КАК ПериодНоминала
	|ПОМЕСТИТЬ ТаблицаПериодовНоминала
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ КАК НоминалЦБ
	|		ПО ЦенныеБумаги.Ссылка = НоминалЦБ.ЦеннаяБумага
	|			И (НоминалЦБ.Период < &Период)
	|			И (НоминалЦБ.Сумма <> 0)
	|ГДЕ
	|	ЦенныеБумаги.Ссылка В
	|			(ВЫБРАТЬ
	|				СписокЦенныхБумаг.Актив КАК Актив
	|			ИЗ
	|				СписокЦенныхБумаг КАК СписокЦенныхБумаг)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦенныеБумаги.Ссылка
	|
	|ИМЕЮЩИЕ
	|	НЕ МАКСИМУМ(НоминалЦБ.Период) ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.Период КАК Период,
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.Биржа КАК Биржа,
	|	Котировки.РежимТоргов КАК РежимТоргов,
	|	Котировки.ИсточникКотировок КАК ИсточникКотировок,
	|	Котировки.ВалютаКотировки КАК ВалютаКотировки,
	|	Котировки.AccInt КАК AccInt,
	|	Котировки.Nkd КАК Nkd
	|ПОМЕСТИТЬ РегистрСведенийКотировкиКупоны
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|ГДЕ
	|	Котировки.Период = &ДатаТ
	|	И Котировки.ЦеннаяБумага.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
	|	И Котировки.ЦеннаяБумага В
	|			(ВЫБРАТЬ
	|				СписокЦенныхБумаг.Актив КАК Актив
	|			ИЗ
	|				СписокЦенныхБумаг КАК СписокЦенныхБумаг)
	|	И Котировки.AccInt > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	МАКСИМУМ(Котировки.Биржа) КАК Биржа
	|ПОМЕСТИТЬ КупоныПоБирже
	|ИЗ
	|	РегистрСведенийКотировкиКупоны КАК Котировки
	|
	|СГРУППИРОВАТЬ ПО
	|	Котировки.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.Биржа КАК Биржа,
	|	МАКСИМУМ(Котировки.РежимТоргов) КАК РежимТоргов
	|ПОМЕСТИТЬ КупоныПоБиржеИРежимуТоргов
	|ИЗ
	|	РегистрСведенийКотировкиКупоны КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КупоныПоБирже КАК КупоныПоБирже
	|		ПО Котировки.ЦеннаяБумага = КупоныПоБирже.ЦеннаяБумага
	|			И Котировки.Биржа = КупоныПоБирже.Биржа
	|
	|СГРУППИРОВАТЬ ПО
	|	Котировки.ЦеннаяБумага,
	|	Котировки.Биржа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.Биржа КАК Биржа,
	|	Котировки.РежимТоргов КАК РежимТоргов,
	|	МАКСИМУМ(Котировки.ИсточникКотировок) КАК ИсточникКотировок
	|ПОМЕСТИТЬ КупоныПоБиржеИРежимуТорговИИсточникуКотировок
	|ИЗ
	|	РегистрСведенийКотировкиКупоны КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КупоныПоБиржеИРежимуТоргов КАК КупоныПоБиржеИРежимуТоргов
	|		ПО Котировки.ЦеннаяБумага = КупоныПоБиржеИРежимуТоргов.ЦеннаяБумага
	|			И Котировки.Биржа = КупоныПоБиржеИРежимуТоргов.Биржа
	|			И Котировки.РежимТоргов = КупоныПоБиржеИРежимуТоргов.РежимТоргов
	|
	|СГРУППИРОВАТЬ ПО
	|	Котировки.ЦеннаяБумага,
	|	Котировки.Биржа,
	|	Котировки.РежимТоргов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.ВалютаКотировки КАК ВалютаКупона,
	|	Котировки.AccInt КАК AccInt,
	|	Котировки.Nkd КАК НКДРуб
	|ПОМЕСТИТЬ Купоны
	|ИЗ
	|	РегистрСведенийКотировкиКупоны КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КупоныПоБиржеИРежимуТорговИИсточникуКотировок КАК КупоныПоБиржеИРежимуТорговИИсточникуКотировок
	|		ПО Котировки.ЦеннаяБумага = КупоныПоБиржеИРежимуТорговИИсточникуКотировок.ЦеннаяБумага
	|			И Котировки.Биржа = КупоныПоБиржеИРежимуТорговИИсточникуКотировок.Биржа
	|			И Котировки.РежимТоргов = КупоныПоБиржеИРежимуТорговИИсточникуКотировок.РежимТоргов
	|			И Котировки.ИсточникКотировок = КупоныПоБиржеИРежимуТорговИИсточникуКотировок.ИсточникКотировок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПогашенныеДолговыеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	|	0 КАК Цена,
	|	0 КАК НКД,
	|	0 КАК НКДРуб,
	|	1 КАК Курс,
	|	5 КАК Уровень,
	|	0 КАК ЦенаРуб,
	|	ПогашенныеДолговыеБумаги.ЦеннаяБумага.ВалютаНоминала КАК Валюта,
	|	НЕОПРЕДЕЛЕНО КАК Биржа,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиКотировок.ПустаяСсылка) КАК ИсточникКотировок,
	|	""ПБ"" КАК КодМетода,
	|	""Погашенная долговая бумага ["" + (ВЫРАЗИТЬ(ЛЕВ(СТРОКА(ПогашенныеДолговыеБумаги.ПоручениеДата), СТРНАЙТИ(СТРОКА(ПогашенныеДолговыеБумаги.ПоручениеДата), "" "") - 1) КАК СТРОКА(10))) + ""]"" КАК Комментарий
	|ПОМЕСТИТЬ Погашенные
	|ИЗ
	|	ПогашенныеДолговыеБумаги КАК ПогашенныеДолговыеБумаги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоминалЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
	|	НоминалЦБ.Сумма + ЕСТЬNULL(ЕСТЬNULL(НКДCbonds.AccInt, НКДПрочее.AccInt), 0) КАК Цена,
	|	ЕСТЬNULL(ЕСТЬNULL(НКДCbonds.AccInt, НКДПрочее.AccInt), 0) КАК НКД,
	|	ЕСТЬNULL(ЕСТЬNULL(НКДCbonds.Nkd, НКДПрочее.Nkd), 0) КАК НКДРуб,
	|	ВЫБОР
	|		КОГДА КурсыВалют.Кратность = 0
	|			ТОГДА КурсыВалют.Курс
	|		ИНАЧЕ КурсыВалют.Курс / КурсыВалют.Кратность
	|	КОНЕЦ КАК Курс,
	|	4 КАК Уровень,
	|	НоминалЦБ.Сумма * ВЫБОР
	|		КОГДА КурсыВалют.Кратность = 0
	|			ТОГДА КурсыВалют.Курс
	|		ИНАЧЕ КурсыВалют.Курс / КурсыВалют.Кратность
	|	КОНЕЦ + ЕСТЬNULL(ЕСТЬNULL(НКДCbonds.Nkd, НКДПрочее.Nkd), 0) КАК ЦенаРуб,
	|	НоминалЦБ.ЦеннаяБумага.ВалютаНоминала КАК Валюта,
	|	НЕОПРЕДЕЛЕНО КАК Биржа,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиКотировок.ПустаяСсылка) КАК ИсточникКотировок,
	|	ВЫБОР
	|		КОГДА НоминалЦБ.ЦеннаяБумага.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
	|			ТОГДА ""ПБ""
	|		ИНАЧЕ ""СД""
	|	КОНЕЦ КАК КодМетода,
	|	ВЫБОР
	|		КОГДА НоминалЦБ.ЦеннаяБумага.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация)
	|				И ВЫБОР
	|					КОГДА НоминалЦБ.ЦеннаяБумага.ДатаПогашения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ НоминалЦБ.ЦеннаяБумага.ДатаПогашения < &ДатаТ
	|				КОНЕЦ
	|			ТОГДА ""Просроченная долговая бумага""
	|		КОГДА НоминалЦБ.ЦеннаяБумага.Дефолтная
	|			ТОГДА ""Дефолтная долговая бумага""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Комментарий,
	|	ЕСТЬNULL(ЕСТЬNULL(НКДCbonds.Биржа, НКДПрочее.Биржа), НЕОПРЕДЕЛЕНО) КАК ИсточникНКД
	|ПОМЕСТИТЬ НоминалЦБ
	|ИЗ
	|	ТаблицаПериодовНоминала КАК ТаблицаПериодовНоминала
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ КАК НоминалЦБ
	|		ПО ТаблицаПериодовНоминала.ЦеннаяБумагаВПериоде = НоминалЦБ.ЦеннаяБумага
	|			И ТаблицаПериодовНоминала.ПериодНоминала = НоминалЦБ.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийКурсыВалют КАК КурсыВалют
	|		ПО (НоминалЦБ.ЦеннаяБумага.ВалютаНоминала = КурсыВалют.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НКД КАК НКДCbonds
	|		ПО ТаблицаПериодовНоминала.ЦеннаяБумагаВПериоде = НКДCbonds.ЦеннаяБумага
	|			И (НКДCbonds.Период = &ДатаТ)
	|			И (НКДCbonds.Биржа = ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.Cbonds))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НКД КАК НКДПрочее
	|		ПО ТаблицаПериодовНоминала.ЦеннаяБумагаВПериоде = НКДПрочее.ЦеннаяБумага
	|			И (НКДПрочее.Период = &ДатаТ)
	|			И (НЕ НКДПрочее.Биржа = ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.Cbonds))
	|ГДЕ
	|	НЕ ТаблицаПериодовНоминала.ЦеннаяБумагаВПериоде В
	|				(ВЫБРАТЬ
	|					ПогашенныеДолговыеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
	|				ИЗ
	|					ПогашенныеДолговыеБумаги КАК ПогашенныеДолговыеБумаги)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КотировкиСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
	|	КотировкиСрезПоследних.indicative_price КАК Цена,
	|	0 КАК НКД,
	|	0 КАК НКДРуб,
	|	ВЫБОР
	|		КОГДА КурсыВалют.Кратность = 0
	|			ТОГДА КурсыВалют.Курс
	|		ИНАЧЕ КурсыВалют.Курс / КурсыВалют.Кратность
	|	КОНЕЦ КАК Курс,
	|	КотировкиСрезПоследних.indicative_price * ВЫБОР
	|		КОГДА КурсыВалют.Кратность = 0
	|			ТОГДА КурсыВалют.Курс
	|		ИНАЧЕ КурсыВалют.Курс / КурсыВалют.Кратность
	|	КОНЕЦ КАК ЦенаРуб,
	|	3 КАК Уровень,
	|	КотировкиСрезПоследних.ВалютаКотировки КАК Валюта,
	|	КотировкиСрезПоследних.Биржа КАК Биржа,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиКотировок.ПустаяСсылка) КАК ИсточникКотировок,
	|	""ПЦ"" КАК КодМетода,
	|	""Цена последней брокерской сделки от ["" + (ВЫРАЗИТЬ(ЛЕВ(СТРОКА(КотировкиСрезПоследних.Период), СТРНАЙТИ(СТРОКА(КотировкиСрезПоследних.Период), "" "") - 1) КАК СТРОКА(10))) + ""]"" КАК Комментарий
	|ПОМЕСТИТЬ КотировкиBQ
	|ИЗ
	|	РегистрСведений.Котировки.СрезПоследних(
	|			&Период,
	|			Период МЕЖДУ &НачалоПериодаКотировокBQ И &КонецПериодаКотировок
	|				И indicative_price > 0
	|				И Биржа = ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.BQ)
	|				И РежимТоргов = ЗНАЧЕНИЕ(Справочник.РежимыТоргов.Индикативный)
	|				И ИсточникКотировок = ЗНАЧЕНИЕ(Справочник.ИсточникиКотировок.ПустаяСсылка)
	|				И ЦеннаяБумага В
	|					(ВЫБРАТЬ
	|						СписокЦенныхБумаг.Актив КАК Актив
	|					ИЗ
	|						СписокЦенныхБумаг КАК СписокЦенныхБумаг)
	|				И НЕ ВЫБОР
	|						КОГДА ЦеннаяБумага.ДатаПогашения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							ТОГДА ЛОЖЬ
	|						ИНАЧЕ ЦеннаяБумага.ДатаПогашения < &ДатаТ
	|					КОНЕЦ) КАК КотировкиСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийКурсыВалют КАК КурсыВалют
	|		ПО КотировкиСрезПоследних.ВалютаКотировки = КурсыВалют.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КотировкиСрезПоследних.Период КАК Период,
	|	КотировкиСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
	|	КотировкиСрезПоследних.Биржа КАК Биржа,
	|	КотировкиСрезПоследних.РежимТоргов КАК РежимТоргов,
	|	КотировкиСрезПоследних.ИсточникКотировок КАК ИсточникКотировок,
	|	КотировкиСрезПоследних.ВалютаКотировки КАК ВалютаКотировки,
	|	КотировкиСрезПоследних.indicative_price КАК indicative_price
	|ПОМЕСТИТЬ РегистрСведенийКотировкиСрезПоследнихCBonds
	|ИЗ
	|	РегистрСведений.Котировки.СрезПоследних(
	|			&Период,
	|			Период МЕЖДУ &НачалоПериодаКотировок И &КонецПериодаКотировок
	|				И indicative_price > 0
	|				И Биржа = ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.CBonds)
	|				И РежимТоргов = ЗНАЧЕНИЕ(Справочник.РежимыТоргов.Индикативный)
	|				И НЕ ЦеннаяБумага.Дефолтная
	|				И ЦеннаяБумага В
	|					(ВЫБРАТЬ
	|						СписокЦенныхБумаг.Актив КАК Актив
	|					ИЗ
	|						СписокЦенныхБумаг КАК СписокЦенныхБумаг)
	|				И НЕ ВЫБОР
	|						КОГДА ЦеннаяБумага.ДатаПогашения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							ТОГДА ЛОЖЬ
	|						ИНАЧЕ ЦеннаяБумага.ДатаПогашения < &ДатаТ
	|					КОНЕЦ) КАК КотировкиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КотировкиСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумагаСрезПлощадкиМаксимальныйПериод,
	|	МАКСИМУМ(КотировкиСрезПоследних.Период) КАК ПериодНоминала
	|ПОМЕСТИТЬ КотировкиCBondsТаблицаПериодов
	|ИЗ
	|	РегистрСведенийКотировкиСрезПоследнихCBonds КАК КотировкиСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	КотировкиСрезПоследних.ЦеннаяБумага
	|
	|ИМЕЮЩИЕ
	|	НЕ МАКСИМУМ(КотировкиСрезПоследних.Период) ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КотировкиСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумагаСрезПлощадкиМаксимальныйПериод,
	|	КотировкиСрезПоследних.Период КАК ПериодНоминала,
	|	МАКСИМУМ(КотировкиСрезПоследних.ИсточникКотировок) КАК ИсточникКотировок
	|ПОМЕСТИТЬ КотировкиCBondsТаблицаПериодовБезДублейИсточников
	|ИЗ
	|	РегистрСведенийКотировкиСрезПоследнихCBonds КАК КотировкиСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КотировкиCBondsТаблицаПериодов КАК КотировкиCBondsТаблицаПериодов
	|		ПО КотировкиСрезПоследних.ЦеннаяБумага = КотировкиCBondsТаблицаПериодов.ЦеннаяБумагаСрезПлощадкиМаксимальныйПериод
	|			И КотировкиСрезПоследних.Период = КотировкиCBondsТаблицаПериодов.ПериодНоминала
	|
	|СГРУППИРОВАТЬ ПО
	|	КотировкиСрезПоследних.ЦеннаяБумага,
	|	КотировкиСрезПоследних.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КотировкиСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
	|	КотировкиСрезПоследних.indicative_price + ВЫБОР
	|		КОГДА Купоны.AccInt ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Купоны.ВалютаКупона = КотировкиСрезПоследних.ВалютаКотировки
	|					ТОГДА Купоны.AccInt
	|				ИНАЧЕ Купоны.НКДРуб / ВЫБОР
	|						КОГДА КурсыВалют.Кратность = 0
	|							ТОГДА КурсыВалют.Курс
	|						ИНАЧЕ КурсыВалют.Курс / КурсыВалют.Кратность
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА Купоны.AccInt ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Купоны.ВалютаКупона = КотировкиСрезПоследних.ВалютаКотировки
	|					ТОГДА Купоны.AccInt
	|				ИНАЧЕ Купоны.НКДРуб / ВЫБОР
	|						КОГДА КурсыВалют.Кратность = 0
	|							ТОГДА КурсыВалют.Курс
	|						ИНАЧЕ КурсыВалют.Курс / КурсыВалют.Кратность
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК НКД,
	|	ЕСТЬNULL(Купоны.НКДРуб, 0) КАК НКДРуб,
	|	ВЫБОР
	|		КОГДА КурсыВалют.Кратность = 0
	|			ТОГДА КурсыВалют.Курс
	|		ИНАЧЕ КурсыВалют.Курс / КурсыВалют.Кратность
	|	КОНЕЦ КАК Курс,
	|	КотировкиСрезПоследних.indicative_price * ВЫБОР
	|		КОГДА КурсыВалют.Кратность = 0
	|			ТОГДА КурсыВалют.Курс
	|		ИНАЧЕ КурсыВалют.Курс / КурсыВалют.Кратность
	|	КОНЕЦ + ЕСТЬNULL(Купоны.НКДРуб, 0) КАК ЦенаРуб,
	|	2 КАК Уровень,
	|	КотировкиСрезПоследних.ВалютаКотировки КАК Валюта,
	|	КотировкиСрезПоследних.Биржа КАК Биржа,
	|	КотировкиСрезПоследних.ИсточникКотировок КАК ИсточникКотировок,
	|	""РЦ"" КАК КодМетода,
	|	"""" КАК Комментарий,
	|	КотировкиСрезПоследних.Биржа КАК ИсточникНКД
	|ПОМЕСТИТЬ КотировкиCBonds
	|ИЗ
	|	РегистрСведенийКотировкиСрезПоследнихCBonds КАК КотировкиСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийКурсыВалют КАК КурсыВалют
	|		ПО КотировкиСрезПоследних.ВалютаКотировки = КурсыВалют.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ Купоны КАК Купоны
	|		ПО КотировкиСрезПоследних.ЦеннаяБумага = Купоны.ЦеннаяБумага
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КотировкиCBondsТаблицаПериодовБезДублейИсточников КАК КотировкиCBondsТаблицаПериодовБезДублейИсточников
	|		ПО КотировкиСрезПоследних.ЦеннаяБумага = КотировкиCBondsТаблицаПериодовБезДублейИсточников.ЦеннаяБумагаСрезПлощадкиМаксимальныйПериод
	|			И КотировкиСрезПоследних.Период = КотировкиCBondsТаблицаПериодовБезДублейИсточников.ПериодНоминала
	|			И КотировкиСрезПоследних.ИсточникКотировок = КотировкиCBondsТаблицаПериодовБезДублейИсточников.ИсточникКотировок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КотировкиСрезПоследних.Период КАК Период,
	|	КотировкиСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
	|	КотировкиСрезПоследних.Биржа КАК Биржа,
	|	КотировкиСрезПоследних.РежимТоргов КАК РежимТоргов,
	|	КотировкиСрезПоследних.ИсточникКотировок КАК ИсточникКотировок,
	|	КотировкиСрезПоследних.ВалютаКотировки КАК ВалютаКотировки,
	|	КотировкиСрезПоследних.last_price КАК last_price,
	|	КотировкиСрезПоследних.LegalClosePrice КАК LegalClosePrice
	|ПОМЕСТИТЬ РегистрСведенийКотировкиСрезПоследнихНРД
	|ИЗ
	|	РегистрСведений.Котировки.СрезПоследних(
	|			&Период,
	|			Период МЕЖДУ &НачалоПериодаКотировок И &КонецПериодаКотировок
	|				И ВЫБОР
	|					КОГДА last_price > 0
	|						ТОГДА last_price
	|					КОГДА LegalClosePrice > 0
	|						ТОГДА LegalClosePrice
	|					ИНАЧЕ 0
	|				КОНЕЦ > 0
	|				И Биржа = ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.НРД)
	|				И ЦеннаяБумага В
	|					(ВЫБРАТЬ
	|						СписокЦенныхБумаг.Актив КАК Актив
	|					ИЗ
	|						СписокЦенныхБумаг КАК СписокЦенныхБумаг)
	|				И НЕ ВЫБОР
	|						КОГДА ЦеннаяБумага.ДатаПогашения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|							ТОГДА ЛОЖЬ
	|						ИНАЧЕ ЦеннаяБумага.ДатаПогашения < &ДатаТ
	|					КОНЕЦ) КАК КотировкиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КотировкиСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумагаСрезПлощадкиМаксимальныйПериод,
	|	МАКСИМУМ(КотировкиСрезПоследних.Период) КАК ПериодНоминала
	|ПОМЕСТИТЬ КотировкиНРДТаблицаПериодов
	|ИЗ
	|	РегистрСведенийКотировкиСрезПоследнихНРД КАК КотировкиСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	КотировкиСрезПоследних.ЦеннаяБумага
	|
	|ИМЕЮЩИЕ
	|	НЕ МАКСИМУМ(КотировкиСрезПоследних.Период) ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КотировкиСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумагаСрезПлощадкиМаксимальныйПериод,
	|	КотировкиСрезПоследних.Период КАК ПериодНоминала,
	|	МАКСИМУМ(КотировкиСрезПоследних.ИсточникКотировок) КАК ИсточникКотировок
	|ПОМЕСТИТЬ КотировкиНРДТаблицаПериодовБезДублейИсточников
	|ИЗ
	|	РегистрСведенийКотировкиСрезПоследнихНРД КАК КотировкиСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КотировкиНРДТаблицаПериодов КАК КотировкиНРДТаблицаПериодов
	|		ПО КотировкиСрезПоследних.ЦеннаяБумага = КотировкиНРДТаблицаПериодов.ЦеннаяБумагаСрезПлощадкиМаксимальныйПериод
	|			И КотировкиСрезПоследних.Период = КотировкиНРДТаблицаПериодов.ПериодНоминала
	|
	|СГРУППИРОВАТЬ ПО
	|	КотировкиСрезПоследних.ЦеннаяБумага,
	|	КотировкиСрезПоследних.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КотировкиСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумагаСрезПлощадкиМаксимальныйПериод,
	|	КотировкиСрезПоследних.Период КАК ПериодНоминала,
	|	КотировкиСрезПоследних.ИсточникКотировок КАК ИсточникКотировок,
	|	МАКСИМУМ(КотировкиСрезПоследних.РежимТоргов) КАК РежимТоргов
	|ПОМЕСТИТЬ КотировкиНРДТаблицаПериодовБезДублейИсточниковБезДублейРежимовТоргов
	|ИЗ
	|	РегистрСведенийКотировкиСрезПоследнихНРД КАК КотировкиСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КотировкиНРДТаблицаПериодовБезДублейИсточников КАК КотировкиНРДТаблицаПериодовБезДублейИсточников
	|		ПО КотировкиСрезПоследних.ЦеннаяБумага = КотировкиНРДТаблицаПериодовБезДублейИсточников.ЦеннаяБумагаСрезПлощадкиМаксимальныйПериод
	|			И КотировкиСрезПоследних.Период = КотировкиНРДТаблицаПериодовБезДублейИсточников.ПериодНоминала
	|			И КотировкиСрезПоследних.ИсточникКотировок = КотировкиНРДТаблицаПериодовБезДублейИсточников.ИсточникКотировок
	|
	|СГРУППИРОВАТЬ ПО
	|	КотировкиСрезПоследних.ЦеннаяБумага,
	|	КотировкиСрезПоследних.Период,
	|	КотировкиСрезПоследних.ИсточникКотировок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КотировкиСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА КотировкиСрезПоследних.last_price > 0
	|			ТОГДА КотировкиСрезПоследних.last_price
	|		КОГДА КотировкиСрезПоследних.LegalClosePrice > 0
	|			ТОГДА КотировкиСрезПоследних.LegalClosePrice
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена,
	|	0 КАК НКД,
	|	0 КАК НКДРуб,
	|	ВЫБОР
	|		КОГДА КурсыВалют.Кратность = 0
	|			ТОГДА КурсыВалют.Курс
	|		ИНАЧЕ КурсыВалют.Курс / КурсыВалют.Кратность
	|	КОНЕЦ КАК Курс,
	|	ВЫБОР
	|		КОГДА КотировкиСрезПоследних.last_price > 0
	|			ТОГДА КотировкиСрезПоследних.last_price
	|		КОГДА КотировкиСрезПоследних.LegalClosePrice > 0
	|			ТОГДА КотировкиСрезПоследних.LegalClosePrice
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР
	|		КОГДА КурсыВалют.Кратность = 0
	|			ТОГДА КурсыВалют.Курс
	|		ИНАЧЕ КурсыВалют.Курс / КурсыВалют.Кратность
	|	КОНЕЦ КАК ЦенаРуб,
	|	1 КАК Уровень,
	|	КотировкиСрезПоследних.ВалютаКотировки КАК Валюта,
	|	КотировкиСрезПоследних.Биржа КАК Биржа,
	|	КотировкиСрезПоследних.ИсточникКотировок КАК ИсточникКотировок,
	|	""РЦ"" КАК КодМетода,
	|	"""" КАК Комментарий
	|ПОМЕСТИТЬ КотировкиНРД
	|ИЗ
	|	РегистрСведенийКотировкиСрезПоследнихНРД КАК КотировкиСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийКурсыВалют КАК КурсыВалют
	|		ПО КотировкиСрезПоследних.ВалютаКотировки = КурсыВалют.Валюта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КотировкиНРДТаблицаПериодовБезДублейИсточниковБезДублейРежимовТоргов КАК КотировкиНРДТаблицаПериодовБезДублейИсточниковБезДублейРежимовТоргов
	|		ПО КотировкиСрезПоследних.ЦеннаяБумага = КотировкиНРДТаблицаПериодовБезДублейИсточниковБезДублейРежимовТоргов.ЦеннаяБумагаСрезПлощадкиМаксимальныйПериод
	|			И КотировкиСрезПоследних.Период = КотировкиНРДТаблицаПериодовБезДублейИсточниковБезДублейРежимовТоргов.ПериодНоминала
	|			И КотировкиСрезПоследних.ИсточникКотировок = КотировкиНРДТаблицаПериодовБезДублейИсточниковБезДублейРежимовТоргов.ИсточникКотировок
	|			И КотировкиСрезПоследних.РежимТоргов = КотировкиНРДТаблицаПериодовБезДублейИсточниковБезДублейРежимовТоргов.РежимТоргов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокЦенныхБумаг.Актив КАК ЦеннаяБумага,
	|	СписокЦенныхБумаг.Актив.ISIN КАК ISIN,
	|	СписокЦенныхБумаг.ВалютаНоминала КАК ВалютаЦБ,
	|	ЕСТЬNULL(КотировкиНРД.Валюта, ЕСТЬNULL(КотировкиCBonds.Валюта, ЕСТЬNULL(КотировкиBQ.Валюта, ЕСТЬNULL(НоминалЦБ.Валюта, ЕСТЬNULL(Погашенные.Валюта, СписокЦенныхБумаг.Актив.ВалютаНоминала))))) КАК Валюта,
	|	ЕСТЬNULL(КотировкиНРД.Цена, ЕСТЬNULL(КотировкиCBonds.Цена, ЕСТЬNULL(КотировкиBQ.Цена, ЕСТЬNULL(НоминалЦБ.Цена, ЕСТЬNULL(Погашенные.Цена, 0))))) КАК Цена,
	|	ЕСТЬNULL(КотировкиНРД.ЦенаРуб, ЕСТЬNULL(КотировкиCBonds.ЦенаРуб, ЕСТЬNULL(КотировкиBQ.ЦенаРуб, ЕСТЬNULL(НоминалЦБ.ЦенаРуб, ЕСТЬNULL(Погашенные.ЦенаРуб, 0))))) КАК ЦенаРуб,
	|	ЕСТЬNULL(КотировкиНРД.НКД, ЕСТЬNULL(КотировкиCBonds.НКД, ЕСТЬNULL(КотировкиBQ.НКД, ЕСТЬNULL(НоминалЦБ.НКД, ЕСТЬNULL(Погашенные.НКД, 0))))) КАК НКД,
	|	ЕСТЬNULL(КотировкиНРД.НКДРуб, ЕСТЬNULL(КотировкиCBonds.НКДРуб, ЕСТЬNULL(КотировкиBQ.НКДРуб, ЕСТЬNULL(НоминалЦБ.НКДРуб, ЕСТЬNULL(Погашенные.НКДРуб, 0))))) КАК НКДРуб,
	|	ЕСТЬNULL(КотировкиНРД.Биржа, ЕСТЬNULL(КотировкиCBonds.Биржа, ЕСТЬNULL(КотировкиBQ.Биржа, ЕСТЬNULL(НоминалЦБ.Биржа, ЕСТЬNULL(Погашенные.Биржа, НЕОПРЕДЕЛЕНО))))) КАК Биржа,
	|	ЕСТЬNULL(КотировкиНРД.ИсточникКотировок, ЕСТЬNULL(КотировкиCBonds.ИсточникКотировок, ЕСТЬNULL(КотировкиBQ.ИсточникКотировок, ЕСТЬNULL(НоминалЦБ.ИсточникКотировок, ЕСТЬNULL(Погашенные.ИсточникКотировок, ЗНАЧЕНИЕ(Справочник.ИсточникиКотировок.ПустаяСсылка)))))) КАК ИсточникКотировок,
	|	1 * ЕСТЬNULL(КотировкиНРД.Уровень, ЕСТЬNULL(КотировкиCBonds.Уровень, ЕСТЬNULL(КотировкиBQ.Уровень, ЕСТЬNULL(НоминалЦБ.Уровень, ЕСТЬNULL(Погашенные.Уровень, 5))))) КАК Уровень,
	|	ЕСТЬNULL(КотировкиНРД.КодМетода, ЕСТЬNULL(КотировкиCBonds.КодМетода, ЕСТЬNULL(КотировкиBQ.КодМетода, ЕСТЬNULL(НоминалЦБ.КодМетода, ЕСТЬNULL(Погашенные.КодМетода, ""ПБ""))))) КАК КодМетода,
	|	ЕСТЬNULL(КотировкиНРД.Комментарий, ЕСТЬNULL(КотировкиCBonds.Комментарий, ЕСТЬNULL(КотировкиBQ.Комментарий, ЕСТЬNULL(НоминалЦБ.Комментарий, ЕСТЬNULL(Погашенные.Комментарий, """"))))) КАК Комментарий,
	|	ЕСТЬNULL(КотировкиCBonds.ИсточникНКД, ЕСТЬNULL(НоминалЦБ.ИсточникНКД, НЕОПРЕДЕЛЕНО)) КАК ИсточникНКД
	|ПОМЕСТИТЬ РыночныеЦеныЦенныхБумаг
	|ИЗ
	|	СписокЦенныхБумаг КАК СписокЦенныхБумаг
	|		ЛЕВОЕ СОЕДИНЕНИЕ КотировкиНРД КАК КотировкиНРД
	|		ПО СписокЦенныхБумаг.Актив = КотировкиНРД.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ КотировкиCBonds КАК КотировкиCBonds
	|		ПО СписокЦенныхБумаг.Актив = КотировкиCBonds.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ КотировкиBQ КАК КотировкиBQ
	|		ПО СписокЦенныхБумаг.Актив = КотировкиBQ.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ НоминалЦБ КАК НоминалЦБ
	|		ПО СписокЦенныхБумаг.Актив = НоминалЦБ.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ Погашенные КАК Погашенные
	|		ПО СписокЦенныхБумаг.Актив = Погашенные.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ДатаТ КАК Период,
	|	&МетодикаРасчета КАК МетодикаРасчета,
	|	РыночныеЦеныЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|	РыночныеЦеныЦенныхБумаг.ISIN КАК ISIN,
	|	РыночныеЦеныЦенныхБумаг.Валюта КАК Валюта,
	|	РыночныеЦеныЦенныхБумаг.ВалютаЦБ КАК ВалютаЦБ,
	|	ЕСТЬNULL(КурсыВалют.Курс, 0) КАК КурсыВалютКурс,
	|	ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК КурсыВалютКратность,
	|	ЕСТЬNULL(КурсыВалютЦБ.Курс, 0) КАК КурсыВалютЦБКурс,
	|	ЕСТЬNULL(КурсыВалютЦБ.Кратность, 1) КАК КурсыВалютЦБКратность,
	|	РыночныеЦеныЦенныхБумаг.Цена КАК Цена,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(19,6)) КАК ЦенаЦБ,		// Из-за проблем с округлениями и разрядностью в SQL ЦенаЦБ
	|												// будет расчетана при обработке результатов запроса
	|	РыночныеЦеныЦенныхБумаг.ЦенаРуб КАК ЦенаРуб,
	|	РыночныеЦеныЦенныхБумаг.НКД КАК НКД,
	|	РыночныеЦеныЦенныхБумаг.НКДРуб КАК НКДРуб,
	|	РыночныеЦеныЦенныхБумаг.Биржа КАК Биржа,
	|	РыночныеЦеныЦенныхБумаг.ИсточникКотировок КАК ИсточникКотировок,
	|	РыночныеЦеныЦенныхБумаг.Уровень КАК Уровень,
	|	РыночныеЦеныЦенныхБумаг.КодМетода КАК КодМетода,
	|	РыночныеЦеныЦенныхБумаг.Комментарий КАК Комментарий,
	|	РыночныеЦеныЦенныхБумаг.ИсточникНКД КАК ИсточникНКД
	|ИЗ
	|	РыночныеЦеныЦенныхБумаг КАК РыночныеЦеныЦенныхБумаг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийКурсыВалют КАК КурсыВалют
	|		ПО РыночныеЦеныЦенныхБумаг.Валюта = КурсыВалют.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийКурсыВалют КАК КурсыВалютЦБ
	|		ПО РыночныеЦеныЦенныхБумаг.ВалютаЦБ = КурсыВалютЦБ.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НужныКотировкиИзвне.ЦеннаяБумага КАК ЦеннаяБумага,
	|	НужныКотировкиИзвне.ISIN КАК ISIN,
	|	НужныКотировкиИзвне.НомерРегистрации КАК НомерРегистрации
	|ИЗ
	|	(ВЫБРАТЬ
	|		РыночныеЦеныЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|		РыночныеЦеныЦенныхБумаг.ISIN КАК ISIN,
	|		РыночныеЦеныЦенныхБумаг.ЦеннаяБумага.НомерРегистрации КАК НомерРегистрации
	|	ИЗ
	|		РыночныеЦеныЦенныхБумаг КАК РыночныеЦеныЦенныхБумаг
	|	ГДЕ
	|		РыночныеЦеныЦенныхБумаг.Уровень > 2
	|		И НЕ РыночныеЦеныЦенныхБумаг.ЦеннаяБумага.Дефолтная
	|		И НЕ ВЫБОР
	|					КОГДА РыночныеЦеныЦенныхБумаг.ЦеннаяБумага.ДатаПогашения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ РыночныеЦеныЦенныхБумаг.ЦеннаяБумага.ДатаПогашения < &ДатаТ
	|				КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПервичныйСписокЦенныхБумаг.Ссылка КАК ЦеннаяБумага,
	|		ПервичныйСписокЦенныхБумаг.ISIN КАК ISIN,
	|		ПервичныйСписокЦенныхБумаг.НомерРегистрации КАК НомерРегистрации
	|	ИЗ
	|		ПервичныйСписокЦенныхБумаг КАК ПервичныйСписокЦенныхБумаг
	|	ГДЕ 
	|		&ЗапросЦеныПоследнейСделкиПоISIN
	|		И ПервичныйСписокЦенныхБумаг.ISIN В(&ISIN)) КАК НужныКотировкиИзвне
	|
	|СГРУППИРОВАТЬ ПО
	|	НужныКотировкиИзвне.ЦеннаяБумага,
	|	НужныКотировкиИзвне.ISIN,
	|	НужныКотировкиИзвне.НомерРегистрации";
	// BSLLS:QueryParseError-on
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции
// BSLLS:MethodSize-on

#КонецОбласти
